run/abl/fullScale/fullScaleBaseRefined/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include        "$FOAM_CASE/data/ablParams"

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform $pressure;

boundaryField
{
    frontField
    {   
        type            zeroGradient;
    }   
    backField
    {   
        type            zeroGradient;
    }   
    sideField
    {   
        type            empty;
    }   
    top 
    { 
        type            prghPressure;
        rho             rho;
        p               uniform $pressure;
        value           uniform $pressure; // optional initial value        
    }
    ground
    {
         type            zeroGradient;

    }
    symPlane
    {
        type            empty;
    }
}
// ************************************************************************* //
